Прежде чем создавать репозиторий и инициализировать Git, проверим текущую установленную
версию пограммы. Для этого в терминале введём команду:  
<kbd>git --version</kbd>  
Если Git установлен на компьютер, вы увидите его текущую версию.  
Программа использует мнемонические команды, которые легко запомнить, если знать  
английский язык.

`Создание Git-репозитория:`  
Берём локальный каталог, который не  
находится под версионным контролем,  
и превращаем его в репозиторий.  
Клонируем существующий репозиторий  
из любого места.  
Команда git init  
Команда git status  
<kbd>git init</kbd>  
Инициализация: указываем папку, в которой  
git начнёт отслеживать изменения  
В папке создаётся скрытая папка .git  
Показывает текущее состояние гита, есть  
ли изменения, которые нужно закоммитить  
(сохранить)  

Команда <kbd>git add</kbd>  
добавляет содержимое рабочего каталога   
в индекс (staging area) для последующего коммита. Эта команда дается последобавления  
файлов.Писать название целиком не обязательно: терминал дозаполнит данные  автоматически  

Команда <kbd>git commit</kbd>  
зафиксировать или сохранить  
По умолчанию <kbd>git commit</kbd> использует лишь этот индекс, так что вы можете использовать <kbd>git add</kbd>  
для сборки слепка вашего следующего коммита.  
Команда git commit берёт все данные, добавленные в индекс с помощью <kbd>git add</kbd>, и сохраняет их  
слепок во внутренней базе данных, а затем сдвигает указатель текущей ветки на этот слепок.  

Команда<kbd>git log</kbd>Команда git checkout  
Журнал изменений  
Перед переключением версии файла в Git  
используйте команду git log, чтобы увидеть  
количество сохранений  

Команда<kbd>git checkout</kbd>  
Журнал изменений  
Перед переключением версии файла в Git  
используйте команду git log, чтобы увидеть  
количество сохранений  
Переключение между версиями.  
Для работы нужно указать не только
интересующий вас коммит, но и вернуться  
в тот, где работаем, при помощи команды  
<kbd>git checkout master</kbd>. 

Команда<kbd>git diff</kbd>
Показывает разницу между текущим файлом
и сохранённым
Перед переключением версии файла в Git
используйте команду git log, чтобы увидеть
количество сохранений
